wiktorpyk/CH32X035_DFP/ch32x035/src/debug.c
/********************************** (C) COPYRIGHT  *******************************
 * File Name          : debug.c
 * Author             : WCH
 * Version            : V1.0.0
 * Date               : 2023/04/06
 * Description        : This file contains all the functions prototypes for UART
 *                      Printf , Delay functions.
*********************************************************************************
* Copyright (c) 2021 Nanjing Qinheng Microelectronics Co., Ltd.
* Attention: This software (modified or not) and binary are used for
* microcontroller manufactured by Nanjing Qinheng Microelectronics.
*******************************************************************************/
#include "debug.h"

static uint8_t  p_us = 0;
static uint16_t p_ms = 0;

#define DEBUG_DATA0_ADDRESS  ((volatile uint32_t*)0xE0000380)
#define DEBUG_DATA1_ADDRESS  ((volatile uint32_t*)0xE0000384)

/* USB CDC Debug Support */
#if(DEBUG == DEBUG_USB_CDC)
#include "ch32x035_usbfs_device.h"

#ifndef DEF_USBD_FS_PACK_SIZE
#define DEF_USBD_FS_PACK_SIZE  64  /* USB Full Speed packet size */
#endif

#define USB_CDC_TX_BUF_SIZE  512
static uint8_t USB_CDC_TxBuf[USB_CDC_TX_BUF_SIZE];
static volatile uint16_t USB_CDC_TxWrite = 0;
static volatile uint16_t USB_CDC_TxRead = 0;
static volatile uint8_t USB_CDC_TxBusy = 0;

/* USB CDC Debug Endpoint */
#ifndef USB_CDC_DEBUG_EP
#define USB_CDC_DEBUG_EP  DEF_UEP3
#endif

#endif

/*********************************************************************
 * @fn      Delay_Init
 *
 * @brief   Initializes Delay Funcation.
 *
 * @return  none
 */
void Delay_Init(void)
{
    p_us = SystemCoreClock / 8000000;
    p_ms = (uint16_t)p_us * 1000;
}

/*********************************************************************
 * @fn      Delay_Us
 *
 * @brief   Microsecond Delay Time.
 *
 * @param   n - Microsecond number.
 *
 * @return  None
 */
void Delay_Us(uint32_t n)
{
    uint32_t i;

    SysTick->SR &= ~(1 << 0);
    i = (uint32_t)n * p_us;

    SysTick->CMP = i;
    SysTick->CTLR |= (1 << 4);
    SysTick->CTLR |= (1 << 5) | (1 << 0);

    while((SysTick->SR & (1 << 0)) != (1 << 0));
    SysTick->CTLR &= ~(1 << 0);
}

/*********************************************************************
 * @fn      Delay_Ms
 *
 * @brief   Millisecond Delay Time.
 *
 * @param   n - Millisecond number.
 *
 * @return  None
 */
void Delay_Ms(uint32_t n)
{
    uint32_t i;

    SysTick->SR &= ~(1 << 0);
    i = (uint32_t)n * p_ms;

    SysTick->CMP = i;
    SysTick->CTLR |= (1 << 4);
    SysTick->CTLR |= (1 << 5) | (1 << 0);

    while((SysTick->SR & (1 << 0)) != (1 << 0));
    SysTick->CTLR &= ~(1 << 0);
}

/*********************************************************************
 * @fn      USART_Printf_Init
 *
 * @brief   Initializes the USARTx peripheral.
 *
 * @param   baudrate - USART communication baud rate.
 *
 * @return  None
 */
void USART_Printf_Init(uint32_t baudrate)
{
    GPIO_InitTypeDef  GPIO_InitStructure;
    USART_InitTypeDef USART_InitStructure;

#if(DEBUG == DEBUG_UART1)
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1 | RCC_APB2Periph_GPIOB, ENABLE);

    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
    GPIO_Init(GPIOB, &GPIO_InitStructure);

#elif(DEBUG == DEBUG_UART2)
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART2, ENABLE);
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);

    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_2;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
    GPIO_Init(GPIOA, &GPIO_InitStructure);

#elif(DEBUG == DEBUG_UART3)
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART3, ENABLE);
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);

    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_3;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
    GPIO_Init(GPIOB, &GPIO_InitStructure);

#endif

    USART_InitStructure.USART_BaudRate = baudrate;
    USART_InitStructure.USART_WordLength = USART_WordLength_8b;
    USART_InitStructure.USART_StopBits = USART_StopBits_1;
    USART_InitStructure.USART_Parity = USART_Parity_No;
    USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
    USART_InitStructure.USART_Mode = USART_Mode_Tx;

#if(DEBUG == DEBUG_UART1)
    USART_Init(USART1, &USART_InitStructure);
    USART_Cmd(USART1, ENABLE);

#elif(DEBUG == DEBUG_UART2)
    USART_Init(USART2, &USART_InitStructure);
    USART_Cmd(USART2, ENABLE);

#elif(DEBUG == DEBUG_UART3)
    USART_Init(USART3, &USART_InitStructure);
    USART_Cmd(USART3, ENABLE);

#endif
}

/*********************************************************************
 * @fn      SDI_Printf_Enable
 *
 * @brief   Initializes the SDI printf Function.
 *
 * @param   None
 *
 * @return  None
 */
void SDI_Printf_Enable(void)
{
    *(DEBUG_DATA0_ADDRESS) = 0;
    Delay_Init();
    Delay_Ms(1);
}

/*********************************************************************
 * @fn      USB_CDC_Printf_Init
 *
 * @brief   Initializes USB CDC printf Function.
 *          Note: USB must be initialized before calling this function.
 *
 * @param   None
 *
 * @return  None
 */
void USB_CDC_Printf_Init(void)
{
#if(DEBUG == DEBUG_USB_CDC)
    USB_CDC_TxWrite = 0;
    USB_CDC_TxRead = 0;
    USB_CDC_TxBusy = 0;
#endif
}

/*********************************************************************
 * @fn      USB_CDC_Flush
 *
 * @brief   Flush USB CDC transmit buffer (internal function).
 *
 * @param   None
 *
 * @return  None
 */
#if(DEBUG == DEBUG_USB_CDC)
static void USB_CDC_Flush(void)
{
    uint16_t len;
    uint8_t temp_buf[DEF_USBD_FS_PACK_SIZE];
    
    /* Check if endpoint is busy */
    if(USBFS_Endp_Busy[USB_CDC_DEBUG_EP] != 0)
    {
        return;
    }
    
    /* Calculate available data */
    if(USB_CDC_TxWrite >= USB_CDC_TxRead)
    {
        len = USB_CDC_TxWrite - USB_CDC_TxRead;
    }
    else
    {
        len = USB_CDC_TX_BUF_SIZE - USB_CDC_TxRead;
    }
    
    if(len == 0)
    {
        USB_CDC_TxBusy = 0;
        return;
    }
    
    /* Limit to max packet size */
    if(len > DEF_USBD_FS_PACK_SIZE)
    {
        len = DEF_USBD_FS_PACK_SIZE;
    }
    
    /* Copy data to temporary buffer */
    for(uint16_t i = 0; i < len; i++)
    {
        temp_buf[i] = USB_CDC_TxBuf[USB_CDC_TxRead];
        USB_CDC_TxRead = (USB_CDC_TxRead + 1) % USB_CDC_TX_BUF_SIZE;
    }
    
    /* Send via USB */
    USBFS_Endp_DataUp(USB_CDC_DEBUG_EP, temp_buf, len, DEF_UEP_CPY_LOAD);
    USB_CDC_TxBusy = 1;
}
#endif

/*********************************************************************
 * @fn      USB_CDC_Process
 *
 * @brief   Process USB CDC transmit (should be called periodically).
 *          This is automatically called in _write, but can be called
 *          from main loop for better performance.
 *
 * @param   None
 *
 * @return  None
 */
void USB_CDC_Process(void)
{
#if(DEBUG == DEBUG_USB_CDC)
    if(USB_CDC_TxBusy && USBFS_Endp_Busy[USB_CDC_DEBUG_EP] == 0)
    {
        USB_CDC_Flush();
    }
#endif
}

/*********************************************************************
 * @fn      _write
 *
 * @brief   Support Printf Function
 *
 * @param   *buf - UART send Data.
 *          size - Data length
 *
 * @return  size - Data length
 */
__attribute__((used))
int _write(int fd, char *buf, int size)
{
    int i = 0;

#if (SDI_PRINT == SDI_PR_OPEN)
    int writeSize = size;

    do
    {

        /**
         * data0  data1 ��8���ֽ�
         * data0���λ���ֽڴ�ų��ȣ����Ϊ 7
         *
         */

        while( (*(DEBUG_DATA0_ADDRESS) != 0u))
        {

        }

        if(writeSize>7)
        {
            *(DEBUG_DATA1_ADDRESS) = (*(buf+i+3)) | (*(buf+i+4)<<8) | (*(buf+i+5)<<16) | (*(buf+i+6)<<24);
            *(DEBUG_DATA0_ADDRESS) = (7u) | (*(buf+i)<<8) | (*(buf+i+1)<<16) | (*(buf+i+2)<<24);

            i += 7;
            writeSize -= 7;
        }
        else
        {
            *(DEBUG_DATA1_ADDRESS) = (*(buf+i+3)) | (*(buf+i+4)<<8) | (*(buf+i+5)<<16) | (*(buf+i+6)<<24);
            *(DEBUG_DATA0_ADDRESS) = (writeSize) | (*(buf+i)<<8) | (*(buf+i+1)<<16) | (*(buf+i+2)<<24);

            writeSize = 0;
        }

    } while (writeSize);

#elif(DEBUG == DEBUG_USB_CDC)
    /* USB CDC Mode */
    for(i = 0; i < size; i++)
    {
        /* Add to circular buffer */
        USB_CDC_TxBuf[USB_CDC_TxWrite] = *buf++;
        USB_CDC_TxWrite = (USB_CDC_TxWrite + 1) % USB_CDC_TX_BUF_SIZE;
        
        /* Check for buffer overflow */
        if(USB_CDC_TxWrite == USB_CDC_TxRead)
        {
            /* Buffer full, drop oldest data */
            USB_CDC_TxRead = (USB_CDC_TxRead + 1) % USB_CDC_TX_BUF_SIZE;
        }
    }
    
    /* Trigger send if not already busy */
    if(!USB_CDC_TxBusy)
    {
        USB_CDC_Flush();
    }

#else
    for(i = 0; i < size; i++){
#if(DEBUG == DEBUG_UART1)
        while(USART_GetFlagStatus(USART1, USART_FLAG_TC) == RESET);
        USART_SendData(USART1, *buf++);
#elif(DEBUG == DEBUG_UART2)
        while(USART_GetFlagStatus(USART2, USART_FLAG_TC) == RESET);
        USART_SendData(USART2, *buf++);
#elif(DEBUG == DEBUG_UART3)
        while(USART_GetFlagStatus(USART3, USART_FLAG_TC) == RESET);
        USART_SendData(USART3, *buf++);
#endif
    }
#endif
    return size;
}

/*********************************************************************
 * @fn      _sbrk
 *
 * @brief   Change the spatial position of data segment.
 *
 * @return  size - Data length
 */
__attribute__((used))
void *_sbrk(ptrdiff_t incr)
{
    extern char _end[];
    extern char _heap_end[];
    static char *curbrk = _end;

    if ((curbrk + incr < _end) || (curbrk + incr > _heap_end))
    return NULL - 1;

    curbrk += incr;
    return curbrk - incr;
}
